nataliurena1985/STM32dab/Recursos/Recursos.c
#include "ff.h"
#include "fatfs.h"
#include "main.h"
#include "stm32f3xx_hal_dma.h"
#include "stm32f3xx_hal.h"
#include "ILI9341_Driver.h"
#include <stdlib.h>
#include <string.h>
#include "Memoria.h"
#include "fatfs_sd.h"
#include "user_diskio.h"
#include "Recursos.h"
#include "Aplicacion.h"
#include "XPT2046_touch.h"
#include "stdio.h"
#include "OSC.h"


char m_Conf;
unsigned char* m_Memoria;
char BuscarCodigo(long punt);
char BusquedaStr(char *a, char *b);
char m_TecladoStr[50];
unsigned int m_TecladoIndice=0;
unsigned int m_IndicePel=0;
char m_Teclado=0;

unsigned int m_MenuMax;
char m_MenuStr[30][25];
unsigned int MedirVerde(void);
unsigned int MedirBlanco(void);
unsigned int MedirCorriente(void);

void DPMChico(unsigned int x,unsigned int y,unsigned char LargoBoton,unsigned int ColorFont,unsigned int ColorFondo,char* str);

void GraficarOSC(void);
void Graficar5(void);
void Graficar6(void);
void Graficar5E(void);
void Graficar5G(void);
void Graficar6E(void);
void GraficarPWM(void);
void Graficar(unsigned int x,unsigned int y,unsigned int orix,unsigned int oriy,unsigned int color);

void PanTecladoCodigo(unsigned char* Titulo,unsigned char QRen);
void MuestraXY(void);

void f_TECLADO_ALFA_open(FIL* f);
void f_TECLADO_ALFA_Input(FIL* fi,unsigned int PantallaSI,unsigned int PantallaNO);
void f_TECLADO_ALFA_fondo(FIL* f);

void f_PEL_open(FIL* f,char* Dir,char* Name,unsigned int QEsc);
void f_PEL(FIL* Pel,unsigned int x,unsigned int y,unsigned int offx,unsigned int offy,unsigned char Esc);
void f_PEL_close(FIL* f,unsigned int QEsc);

unsigned int f_BOT_Ancho[6];
unsigned int f_BOT_Alto[6];
void f_BOT_open(FIL* f,char* Name);
void f_BOT(FIL* Bot,unsigned int x,unsigned int y,unsigned char Est);
void f_BOT_close(FIL* f);
unsigned char f_BOT_Activo(FIL* Bot,unsigned int x,unsigned int y);

void f_BCO_open(FIL* f,char* Name);
void f_BCO(FIL* Bot,unsigned int x,unsigned int y,unsigned char Est,unsigned char Largo,unsigned char Pos,char* str);
void f_BCO_close(FIL* f);
unsigned char f_BCO_Activo(unsigned int x,unsigned int y,unsigned char Est,unsigned char Largo);

void f_BOP(FIL* f,unsigned int x,unsigned int y,unsigned int wx,unsigned int wy,unsigned char Est);

void f_PIC_open(FIL* f,char* Name);
void f_PIC(FIL* f,unsigned int x,unsigned int y);
void f_PIC_close(FIL* f);

void f_BMP(char* File,unsigned int x,unsigned int y);

unsigned char  StaticBox2_Activo(unsigned int x,unsigned int y,unsigned char LargoBoton);

unsigned char  Zona_Activo(unsigned int x1,unsigned int y1,unsigned int x2,unsigned int y2);

void PIC(unsigned char* File,unsigned int x,unsigned int y,unsigned char Brillo);

void BOP(FIL* f,unsigned int x,unsigned int y,unsigned int wx,unsigned int wy,unsigned char Est);
void BOT(unsigned char* ID,unsigned int x,unsigned int y,unsigned char Est);
unsigned char  BOT_Activo(unsigned char* ID,unsigned int x,unsigned int y);

unsigned char BOW_PX(unsigned int x,unsigned int y,unsigned int m_PantallaDest,unsigned char LargoBoton,char* str);
unsigned char BOW_Activo(unsigned int x,unsigned int y,unsigned char LargoBoton);

unsigned long Vin2Res(unsigned long in,unsigned long R);
unsigned long Ajustar(unsigned long Valor,unsigned long Numerador,unsigned long Denominador);

void MenuSet(unsigned char MenuNro,char* Buffer,unsigned int PantallaProx);
void MenuPrint();
void MenuAtencion(void);


void CHECK_CIRC(unsigned int x,unsigned int y,char* a,char* b,unsigned char Est);
unsigned char  CHECK_CIRC_Activo(unsigned int x,unsigned int y);


//////////////////////////////////////////////////////////
// PELICULAS DESDE SD FILE
//////////////////////////////////////////////////////////
void f_PEL_open(FIL* f,char* Dir,char* Name,unsigned int QEsc)
{
	int i;
	TP_CS_OFF;
	TFT_CS_OFF;
	SD_CS_ON;

	char File[50];
	for(i=0;i<=QEsc;i++)
	{
		sprintf(File,"%s/PEL %s/PEL %s %d.bmp",Dir,Name,Name,i);
		f_open(&f[i],File,FA_READ);
	}
	SD_CS_OFF;
}
void f_PEL(FIL* Pel,unsigned int x,unsigned int y,unsigned int offx,unsigned int offy,unsigned char Esc)
{
    unsigned int xx;
    unsigned int yy;

    if(Esc==0)
    {
      xx=x;
      yy=y;
    }
    else
    {
      xx=x+offx;
      yy=y+offy;
    }
    f_PIC(&Pel[Esc],xx,yy);
}
void f_PEL_close(FIL* f,unsigned int QEsc)
{
	TP_CS_OFF;
	TFT_CS_OFF;
	SD_CS_ON;
	int i;

	for(i=0;i<QEsc;i++)
	{

		f_close(&f[i]);
	}
	SD_CS_OFF;
}
//////////////////////////////////////////////////////////
// BOTON CORREDERA DESDE SD FILE
//////////////////////////////////////////////////////////
void f_BCO_open(FIL* f,char* Name)
{
	int i;
	TP_CS_OFF;
	TFT_CS_OFF;
	SD_CS_ON;
	char File[50];
	sprintf(File,"BOT/BOT %s V.bmp",Name);
	f_open(&f[0],File,FA_READ);
	sprintf(File,"BOT/BOT %s H.bmp",Name);
	f_open(&f[1],File,FA_READ);
	SD_CS_OFF;
}
void f_BCO(FIL* Bot,unsigned int x,unsigned int y,unsigned char Est,unsigned char Largo,unsigned char Pos,char* str)
{
	TP_CS_OFF;
	SD_CS_OFF;
	TFT_CS_ON;
    uint16_t colorF=0x64DF;
    uint16_t colorT=0x0000;
    uint16_t xt=x+6+(Largo*3-(unsigned char)strlen(str))*7;
    uint16_t yt=y;
    uint16_t w=Largo*14*3;
    Pos--;

    switch(Est)
    {
    	case 0://H
   		ILI9341_Draw_String(xt,yt,colorT,colorF,str,4);
   		FillReg(x   ,40+y   ,w  ,8 ,0xFC00);
   		FillReg(x+8 ,40+y+8 ,w-8,8 ,BLACK);
   		FillReg(x	,40+y	,8	,24,0xFC00);
   		FillReg(x+w ,40+y	,8	,24,0xFC00);
   		FillReg(x	,40+y+16,w  ,8 ,0xFC00);
    	f_PIC(&fCORREDERA[1],x+14*3*Pos+12,y+30);
    	break;

    	case 1://H
   		FillReg(x   ,40+y   ,w  ,8 ,0xFC00);
   		FillReg(x+8 ,40+y+8 ,w-8,8 ,BLACK);
   		FillReg(x	,40+y	,8	,24,0xFC00);
   		FillReg(x+w ,40+y	,8	,24,0xFC00);
   		FillReg(x	,40+y+16,w  ,8 ,0xFC00);
   		FillReg(x   ,30+y   ,w  ,10,0x64df);
   		FillReg(x   ,64+y   ,w  ,10,0x64df);
   		f_PIC(&fCORREDERA[1],x+14*3*Pos+12,y+30);
   		while( HAL_GPIO_ReadPin(TP_IRQ_GPIO_Port, TP_IRQ_Pin) == 0 );
    	break;

    	case 2://V
   		FillReg(x+2,y+2,w-2,35,colorF);
   		ILI9341_Draw_String(xt+1,yt+1,colorT,colorF,str,4);
   		FillReg(x   ,y   ,8 ,w  ,0xFC00);
  		FillReg(x+8 ,y+8 ,8 ,w-8,BLACK);
   		FillReg(x	,y	 ,24,8  ,0xFC00);
  		FillReg(x   ,y+w ,24,8  ,0xFC00);
   		FillReg(x+16,y   ,8 ,w  ,0xFC00);
    	break;

