nataliurena1985/STM32dab/Recursos/Recursos.c
    	case 3://H
    	f_PIC(&fCORREDERA[1],x+30,y+14*3*Pos+12);
    	break;

    }
}
unsigned char f_BCO_Activo(unsigned int x,unsigned int y,unsigned char Est,unsigned char Largo)
{
	return BCO_Activo(x,y,Est,Largo);
}
void f_BCO_close(FIL* f)
{
	TP_CS_OFF;
	TFT_CS_OFF;
	SD_CS_ON;
	f_close(&f[0]);
	f_close(&f[1]);
	SD_CS_OFF;
}
//////////////////////////////////////////////////////////
// BOTON PIC DESDE SD FILE
//////////////////////////////////////////////////////////
void f_BOT_open(FIL* f,char* Name)
{
	TP_CS_OFF;
	TFT_CS_OFF;
	SD_CS_ON;
	char File[50];
	sprintf(File,"REC/BOT/BOT %s Up.bmp",Name);
	f_open(&f[0],File,FA_READ);
	sprintf(File,"REC/BOT/BOT %s Dn.bmp",Name);
	f_open(&f[1],File,FA_READ);
	SD_CS_OFF;
}
void f_BOT(FIL* Bot,unsigned int x,unsigned int y,unsigned char Est)
{
    switch(Est)
    {
    	case 0://Arriba
    	f_PIC(&Bot[0],x,y);
    	break;

    	case 1://Abajo
       	f_PIC(&Bot[1],x,y);
    	break;

    	case 2: //Baja, espera y va arriba)
       	f_PIC(&Bot[1],x,y);
       	while( HAL_GPIO_ReadPin(TP_IRQ_GPIO_Port, TP_IRQ_Pin) == 0 );
       	f_PIC(&Bot[0],x,y);
    	break;
    }
}
void f_BOT_close(FIL* f)
{
	TP_CS_OFF;
	TFT_CS_OFF;
	SD_CS_ON;
	f_close(&f[0]);
	f_close(&f[1]);
	SD_CS_OFF;
}
unsigned char f_BOT_Activo(FIL* Bot,unsigned int x,unsigned int y)
{

	uint8_t data[55];
	UINT 	br;

	TFT_CS_OFF;
	SD_CS_ON;
	f_lseek(&Bot[0],0);
	f_read(&Bot[0],data,25,&br);
	SD_CS_OFF;

	unsigned int AnchoBMP=data[0x12]+data[0x13]*256;
	unsigned int AltoBMP=data[0x16]+data[0x17]*256;

    if
    (
      (m_XPanel>x && m_XPanel<(x+AnchoBMP))
      &&
      (m_YPanel>y && m_YPanel<(y+AltoBMP))
    ) return 1;
    else return 0;
}
//////////////////////////////////////////////////////////
// BOTON BMP FONDO BLANCO CON BORDE DESDE FILE
//////////////////////////////////////////////////////////
void f_BOP(FIL* f,unsigned int x,unsigned int y,unsigned int wx,unsigned int wy,unsigned char Est)
{
	SD_CS_OFF;
	TFT_CS_ON;
	UINT br;
	unsigned char data[30];

	switch(Est)
    {
    	case 0://Arriba
   		//FillReg(x+2,y+2,wx-2,35,colorF);
   		FillReg(x   ,y	   ,wx  ,2   ,BLACK);
   		FillReg(x	,y	   ,2	  ,wy  ,BLACK);
   		FillReg(x+wx,y	   ,2	  ,wy  ,BLACK);
   		FillReg(x	,y+wy-2,wx  ,2   ,BLACK);
       	FillReg(x+2 ,y+wy-4,wx-4,2   ,DARKGREY);
      	FillReg(x+wx-2,y+2,2    ,wy-4,DARKGREY);
      	FillReg(x+2 ,y+2   ,wx-4 ,2   ,WHITE);
      	FillReg(x+2	,y+2   ,2	 ,wy-4,WHITE);
    	break;

    	case 1://Abajo
   		//FillReg(x+2,y+2,wx-2,35,colorF);
     	FillReg(x   ,y	   ,wx  ,2   ,BLACK);
      	FillReg(x	,y	   ,2	,wy  ,BLACK);
      	FillReg(x+wx,y	   ,2	,wy  ,BLACK);
      	FillReg(x	,y+wy-2,wx  ,2   ,BLACK);
       	FillReg(x+2 ,y+wy-4,wx-4,2   ,WHITE);
     	FillReg(x+wx-2,y+2,2 ,wy-4,WHITE);
   		FillReg(x+2 ,y+2   ,wx-4 ,2   ,DARKGREY);
   		FillReg(x+2	,y+2   ,2	 ,wy-4,DARKGREY);
    	break;

    	case 2://Baja, espera y va arriba)
    	//FillReg(x+2,y+2,wx-2,35,colorF);
       	FillReg(x   ,y	 ,wx    ,2   ,BLACK);
       	FillReg(x	,y	 ,2	    ,wy  ,BLACK);
       	FillReg(x+wx,y	 ,2	    ,wy  ,BLACK);
       	FillReg(x	,y+wy-2,wx  ,2   ,BLACK);

       	FillReg(x+2 ,y+wy-4,wx-4,2   ,WHITE);
     	FillReg(x+wx-2,y+2,2 ,wy-4,WHITE);
   		FillReg(x+2 ,y+2   ,wx-4 ,2   ,DARKGREY);
   		FillReg(x+2	,y+2   ,2	 ,wy-4,DARKGREY);
   		while( HAL_GPIO_ReadPin(TP_IRQ_GPIO_Port, TP_IRQ_Pin) == 0 );

       	HAL_Delay(255);

       	//FillReg(x+2,y+2,wx-2,35,colorF);
   		FillReg(x   ,y	   ,wx   ,2   ,BLACK);
   		FillReg(x	,y	   ,2	 ,wy  ,BLACK);
   		FillReg(x+wx,y	   ,2	 ,wy  ,BLACK);
   		FillReg(x	,y+wy-2,wx   ,2   ,BLACK);

       	FillReg(x+2 ,y+wy-4,wx-4,2   ,DARKGREY);
      	FillReg(x+wx-2,y+2,2    ,wy-4,DARKGREY);
      	FillReg(x+2 ,y+2   ,wx-4 ,2   ,WHITE);
      	FillReg(x+2	,y+2   ,2	 ,wy-4,WHITE);

   		HAL_Delay(55);
    	break;
    }

    TFT_CS_OFF;
    SD_CS_ON;
	f_lseek(f,0);
    f_read(f,data,25,&br);
    unsigned int dx=(wx-((unsigned int)data[0x12]+(unsigned int)data[0x13]*256))/2;
    unsigned int dy=(wy-((unsigned int)data[0x16]+(unsigned int)data[0x17]*256))/2;
    f_PIC(f,x+dx,y+dy);
}

//////////////////////////////////////////////////////////
// TECLADO_ALFA DESDE SD FILE
//////////////////////////////////////////////////////////
void f_TECLADO_ALFA_Input(FIL* fi,unsigned int PantallaSI,unsigned int PantallaNO)
{
   int f,c;
   char str[50];
   char Tecla[41];

   if(m_Teclado==0) sprintf(Tecla,"0123456789QWERTYUIOPASDFGHJKLN#^ZXCVBNM<");
   if(m_Teclado==1) sprintf(Tecla,"0123456789qwertyuiopasdfghjkLn#^zxcvbnm<");
   if(m_Teclado==2) sprintf(Tecla,"~!#$%c&@_?!=+-*%c%c^|xX<>()[]{}oO#^%c'.,:;!<",'%','/','\\','"');


   for(f=0;f<4;f++)
   {
	   for(c=0;c<10;c++)
	   {
		   if( m_XPanel>c*32 && m_XPanel<(c+1)*32 && m_YPanel>80+f*32 && m_YPanel<80+(f+1)*32 )
		   {
	   		    f_PIC(&fi[1],c*32,80+f*32);

	   		    ILI9341_Draw_Char(c*32+12,240-f*32-112,0xffff,0x5AF7,Tecla[f*10+c],4);
	   		    while( HAL_GPIO_ReadPin(TP_IRQ_GPIO_Port, TP_IRQ_Pin) == 0 );
		       	HAL_Delay(255);
 			    f_PIC(&fi[0],c*32,80+f*32);

		    	ILI9341_Draw_Char(c*32+12,240-f*32-112,0xffff,0x0010,Tecla[f*10+c],4);
 			    if(f*10+c != 30 && f*10+c != 31 && f*10+c != 39 && m_TecladoIndice<22)
 			    {
 			    	m_TecladoStr[m_TecladoIndice]=Tecla[f*10+c];
 			    	m_TecladoStr[m_TecladoIndice+1]=0;
 			    	m_TecladoIndice++;
 			    }
 			    if(f*10+c == 39 && m_TecladoIndice>0) m_TecladoIndice--,m_TecladoStr[m_TecladoIndice]=0;
 			    if(f*10+c == 31)
 			    {
 			    	if(m_Teclado!=0) m_Teclado=0;
 			    	else			 m_Teclado=1;
 			    }
 			    if(f*10+c == 30)
 			    {
 			      	if(m_Teclado!=2) m_Teclado=2;
 			       	else			 m_Teclado=0;
 			    }
 			    if(f*10+c == 30 || f*10+c == 31) f_TECLADO_ALFA_fondo(fi);
		   }
	   }
   }
   if( m_XPanel<80 && m_YPanel>208 )
   {
	    f_PIC(&fi[7],0,208);
		ILI9341_Draw_String(26,207,0xffff,0x5AF7, "<-",4);
	    while( HAL_GPIO_ReadPin(TP_IRQ_GPIO_Port, TP_IRQ_Pin) == 0 );
      	HAL_Delay(255);
        f_PIC(&fi[6],0,208);
        ILI9341_Draw_String(26,207,0xffff,0x0010, "<-",4);
        m_Pantalla=PantallaNO;
   }
   if( m_XPanel>80 && m_XPanel<240 && m_YPanel>208 )
   {
	    f_PIC(&fi[5],80,208);
	    while( HAL_GPIO_ReadPin(TP_IRQ_GPIO_Port, TP_IRQ_Pin) == 0 );
      	HAL_Delay(255);
        f_PIC(&fi[4],80,208);
   }
   if( m_XPanel>240 && m_YPanel>208 )
   {
	    f_PIC(&fi[7],240,208);
		ILI9341_Draw_String(266,207,0xffff,0x5AF7, "OK",4);
	    while( HAL_GPIO_ReadPin(TP_IRQ_GPIO_Port, TP_IRQ_Pin) == 0 );
      	HAL_Delay(255);
        f_PIC(&fi[6],240,208);
        ILI9341_Draw_String(266,207,0xffff,0x0010, "OK",4);
        m_Pantalla=PantallaSI;
   }
   sprintf(str,"%s                      ",m_TecladoStr);
   m_TecladoStr[22]=0;
   str[21]=0;
   ILI9341_Draw_String(0,40,0,0x64DF,str,4);
}

void f_TECLADO_ALFA_open(FIL* fi)
{
   int f,c;
   char str[35];

   m_TecladoIndice=0;

