nataliurena1985/STM32dab/Recursos/Recursos.c
   f_PIC_open(&fi[0],"REC/TECLADO ALFA/BOT TECLA UP.bmp");
   f_PIC_open(&fi[1],"REC/TECLADO ALFA/BOT TECLA DN.bmp");
   f_PIC_open(&fi[2],"REC/TECLADO ALFA/BOT BUSCAR UP.bmp");
   f_PIC_open(&fi[3],"REC/TECLADO ALFA/BOT BUSCAR DN.bmp");
   f_PIC_open(&fi[4],"REC/TECLADO ALFA/BOT SP UP.bmp");
   f_PIC_open(&fi[5],"REC/TECLADO ALFA/BOT SP DN.bmp");
   f_PIC_open(&fi[6],"REC/TECLADO ALFA/BOT BARRA UP.bmp");
   f_PIC_open(&fi[7],"REC/TECLADO ALFA/BOT BARRA DN.bmp");
// ILI9341_Draw_String(0,80,WHITE,0x0010,str, 4);

   f_TECLADO_ALFA_fondo(fi);
}

void f_TECLADO_ALFA_fondo(FIL* fi)
{
	int f,c;

	char Tecla[41];

	if(m_Teclado==0) sprintf(Tecla,"0123456789QWERTYUIOPASDFGHJKLN#^ZXCVBNM<");
	if(m_Teclado==1) sprintf(Tecla,"0123456789qwertyuiopasdfghjkLn#^zxcvbnm<");
	if(m_Teclado==2) sprintf(Tecla,"~!#$%c&@_?!=+-*%c%c^|xX<>()[]{}oO#^%c'.,:;!<",'%','/','\\','"');

	for(f=0;f<4;f++)
	{
	   	for(c=0;c<10;c++)
	   	{
	   	   f_PIC(&fi[0],c*32,80+f*32);
	   	   ILI9341_Draw_Char(c*32+12,240-f*32-112,0xffff,0x0010,Tecla[f*10+c],4);
	   	}
	}
	f_PIC(&fi[6],0,208);
	ILI9341_Draw_String(26,207,0xffff,0x0010, "<-",4);
	f_PIC(&fi[4],80,208);
	f_PIC(&fi[6],240,208);
	ILI9341_Draw_String(266,207,0xffff,0x0010,"OK",4);
}

//////////////////////////////////////////////////////////
// PIC DESDE SD FILE
//////////////////////////////////////////////////////////
void f_PIC_open(FIL* f,char* Name)
{
	char File[50];
	TP_CS_OFF;
	TFT_CS_OFF;
	SD_CS_ON;
	f_open(f,Name,FA_READ);
	SD_CS_OFF;
}
void f_PIC_close(FIL* f)
{
	TP_CS_OFF;
	TFT_CS_OFF;
	SD_CS_ON;
	f_close(f);
	SD_CS_OFF;
}
void f_PIC(FIL* f,unsigned int x,unsigned int y)
{
	uint32_t		i,ii,iii;
	uint8_t    		dataOut[512];
	unsigned char 	dataIn[256],color[4],c;
	unsigned int 	col_16,TablaCol[256];
	UINT 			br,ERROR_SD;
	uint32_t		resto;

	TFT_CS_OFF;
	SD_CS_ON;

	f_lseek(f,0);
	f_read(f,dataIn,54,&br);

	uint32_t	AnchoBMP=(unsigned int)dataIn[0x12]+(unsigned int)dataIn[0x13]*256;
	uint32_t	AltoBMP=(unsigned int)dataIn[0x16]+(unsigned int)dataIn[0x17]*256;
	uint32_t	OffsetArray=(unsigned int)dataIn[0x0A]+(unsigned int)dataIn[0x0B]*256;
	uint32_t	LargoTablaColores=(unsigned int)dataIn[0x2E]+(unsigned int)dataIn[0x2F]*256;

	for(i=0;i<LargoTablaColores;i++)
	{
		f_read(f,color,4,&br);
		TablaCol[i]=(color[2]/8)*2048+(color[1]/4)*32+(color[0])/8;
	}

	f_lseek(f,OffsetArray);
	uint32_t Peso=AnchoBMP*AltoBMP;

	SD_CS_OFF;
	TFT_CS_ON;
	ILI9341_Set_Rotation(4);
	unsigned int x1=x;
	unsigned int y1=240-(unsigned int)AltoBMP-y;
	unsigned int x2=AnchoBMP+x-1;
	unsigned int y2=239-y;
	ILI9341_Set_Address(x1,y1,x2,y2);
	TFT_DC_COMMAND;
	dataIn[0]=0x2C;
	HAL_SPI_Transmit(&lcd_spi, dataIn, 1, 1);
	DWORD sect ;

	for(i=0;i<Peso;i=i+256)
	{
		TFT_CS_OFF;
		SD_CS_ON;

		resto = Peso-i;
		if(resto>256) resto=256;

		f_read(f,dataIn,resto,&br);
		for(ii=0,iii=0;ii<resto;ii++,iii++)
		{
			dataOut[iii]=TablaCol[dataIn[ii]]>>8;
			iii++;
			dataOut[iii]=TablaCol[dataIn[ii]];
		}

		SD_CS_OFF;
		TFT_CS_ON;
		TFT_DC_DATA;
		HAL_SPI_Transmit(&lcd_spi,dataOut,resto*2,300);
		TFT_CS_OFF;
	}
}

//////////////////////////////////////////////////////////
// BOTON CORREDERA DESDE FLASH INTERNA
//////////////////////////////////////////////////////////
void BCO(unsigned char* Bot,unsigned int x,unsigned int y,unsigned char Est,unsigned char Largo,unsigned char Pos,char* str)
{
	TP_CS_OFF;
	SD_CS_OFF;
	TFT_CS_ON;
    uint16_t colorF=0x64DF;
    uint16_t colorT=0x0000;
    uint16_t xt=x+6+(Largo*3-(unsigned char)strlen(str))*7;
    uint16_t yt=y;
    uint16_t w=Largo*14*3;
    Pos--;

    switch(Est)
    {
    	case 0://H
   		ILI9341_Draw_String(xt,yt,colorT,colorF,str,4);
   		FillReg(x   ,40+y   ,w  ,8 ,0xFC00);
   		FillReg(x+8 ,40+y+8 ,w-8,8 ,BLACK);
   		FillReg(x	,40+y	,8	,24,0xFC00);
   		FillReg(x+w ,40+y	,8	,24,0xFC00);
   		FillReg(x	,40+y+16,w  ,8 ,0xFC00);
    	PIC(Bot,x+14*3*Pos+12,y+30,0);
    	break;

    	case 1://H
   		FillReg(x   ,40+y   ,w  ,8 ,0xFC00);
   		FillReg(x+8 ,40+y+8 ,w-8,8 ,BLACK);
   		FillReg(x	,40+y	,8	,24,0xFC00);
   		FillReg(x+w ,40+y	,8	,24,0xFC00);
   		FillReg(x	,40+y+16,w  ,8 ,0xFC00);
   		FillReg(x   ,30+y   ,w  ,10,0x64df);
   		FillReg(x   ,64+y   ,w  ,10,0x64df);
   		PIC(Bot,x+14*3*Pos+12,y+30,0);
   		while( HAL_GPIO_ReadPin(TP_IRQ_GPIO_Port, TP_IRQ_Pin) == 0 );
    	break;

    	case 2://V
   		FillReg(x+2,y+2,w-2,35,colorF);
   		ILI9341_Draw_String(xt+1,yt+1,colorT,colorF,str,4);
   		FillReg(x   ,y   ,8 ,w  ,0xFC00);
  		FillReg(x+8 ,y+8 ,8 ,w-8,BLACK);
   		FillReg(x	,y	 ,24,8  ,0xFC00);
  		FillReg(x   ,y+w ,24,8  ,0xFC00);
   		FillReg(x+16,y   ,8 ,w  ,0xFC00);
    	break;

    	case 3://H
    	PIC(Bot,x+30,y+14*3*Pos+12,0);
    	break;
    }
}
unsigned char BCO_Activo(unsigned int x,unsigned int y,unsigned char Est,unsigned char Largo)
{
    uint16_t w=Largo*14*3/Largo;
    uint16_t i;

    x=x+8;

    if(Est==0)
    for(i=0;i<Largo;i++)
    {
    	if
		(
			(m_XPanel>(x+i*w) && m_XPanel<(x+(i+1)*w) )
			&&
			(m_YPanel>y && m_YPanel<(y+62) )
		) return i+1;
    }
    else
   	for(i=0;i<Largo;i++)
    {
    	if
		(
			(m_XPanel>x 	  && m_XPanel<(x+62) )
			&&
			(m_YPanel>(y+i*w) && m_YPanel<(y+(i+1)*w) )
		) return i+1;
    }

    return 0;
}
//////////////////////////////////////////////////////////
// BOTON PIC DESDE FLASH INTERNA
//////////////////////////////////////////////////////////
void BOT(unsigned char* ID,unsigned int x,unsigned int y,unsigned char Est)
{
    switch(Est)
    {
    	case 0://Arriba
   		PIC(ID,x,y,0);
    	//HAL_Delay(255);
    	break;

    	case 1://Abajo
       	PIC(ID,x,y,4);
       	//HAL_Delay(255);
    	break;

    	case 2: //Baja, espera y va arriba)
    	PIC(ID,x,y,4);
    	HAL_Delay(255);
    	PIC(ID,x,y,0);
    	//HAL_Delay(200);
    	break;
    }
}

void CHECK_CIRC(unsigned int x,unsigned int y,char* a,char* b,unsigned char Est)
{
	ILI9341_Draw_String(x,y   ,WHITE,0x0010,a,2);
	ILI9341_Draw_String(x,y+15,WHITE,0x0010,b,2);
	x=x+76;
	y=y+16;
	switch(Est)
    {
    	case 0://FALSO
   		ILI9341_Draw_Circle(x,y,16,0x0000,1);
   		ILI9341_Draw_Circle(x,y,12,0xFFFF,1);
    	break;

