nataliurena1985/STM32dab/Recursos/Recursos.c
    	case 1://VERDADERO
   		ILI9341_Draw_Circle(x,y,16,0x0000,1);
  		ILI9341_Draw_Circle(x,y,12,0xFFFF,1);
  		ILI9341_Draw_Circle(x,y,8 ,0x0000,1);
    	break;
    }
}

unsigned char CHECK_CIRC_Activo(unsigned int x,unsigned int y)
{
	x=x+60;
	if
    (
      (m_XPanel>x && m_XPanel<(x+32) )
      &&
      (m_YPanel>y && m_YPanel<(y+32) )
    )
	{
	   	HAL_Delay(200);
		return 1;
	}

    else return 0;
}


//////////////////////////////////////////////////////////
// BOTON TIPO WINDOWS
//////////////////////////////////////////////////////////
unsigned char BOW_PX(unsigned int x,unsigned int y,unsigned int m_PantallaDest,unsigned char LargoBoton,char* str)
{
	if(BOW_Activo(x,y,LargoBoton) )
	{
		BOW(x,y,2,LargoBoton,str);
		m_Pantalla= m_PantallaDest;
		return 1;
	}
	return 0;
}
void BOW(unsigned int x,unsigned int y,unsigned char Est,unsigned char LargoBoton,char* str)
{
	TP_CS_OFF;
	SD_CS_OFF;
	TFT_CS_ON;
    uint16_t colorF=LIGHTGREY;
    uint16_t colorT=0x0000;
    uint16_t xt=x+2+((LargoBoton-(unsigned char)strlen(str)))*7;
    uint16_t yt=y+3;
    uint16_t wx=LargoBoton*14;
    uint16_t wy=35;

    switch(Est)
    {
    	case 0://Arriba
   		FillReg(x+2,y+2,wx-2,35,colorF);
 		ILI9341_Draw_String(xt,yt,colorT,colorF,str,4);
   		FillReg(x   ,y	 ,wx  ,2  ,BLACK);
   		FillReg(x	,y	 ,2	  ,37 ,BLACK);
   		FillReg(x+wx,y	 ,2	  ,37 ,BLACK);
   		FillReg(x	,y+35,wx  ,2  ,BLACK);
   		FillReg(x+2 ,y+2 ,wx-4,2  ,WHITE);
   		FillReg(x+2	,y+2 ,2	  ,33 ,WHITE);
    	break;

    	case 1://Abajo
   		FillReg(x+2,y+2,wx-2,35,colorF);
   		ILI9341_Draw_String(xt+1,yt+1,colorT,colorF,str,4);
     	FillReg(x   ,y	 ,wx  ,2  ,BLACK);
      	FillReg(x	,y	 ,2	  ,37 ,BLACK);
      	FillReg(x+wx,y	 ,2	  ,37 ,BLACK);
      	FillReg(x	,y+35,wx  ,2  ,BLACK);
      	FillReg(x+2 ,y+33,wx-4,2  ,WHITE);
      	FillReg(x+wx-2,y+2,2  ,33 ,WHITE);
    	break;

    	case 2://Baja, espera y va arriba)
       	FillReg(x+2,y+2,wx-2,35,colorF);
       	ILI9341_Draw_String(xt+1,yt+1,colorT,colorF,str,4);
       	FillReg(x   ,y	 ,wx  ,2  ,BLACK);
       	FillReg(x	,y	 ,2	  ,37 ,BLACK);
       	FillReg(x+wx,y	 ,2	  ,37 ,BLACK);
       	FillReg(x	,y+35,wx  ,2  ,BLACK);
       	FillReg(x+2 ,y+33,wx-4,2  ,WHITE);
      	FillReg(x+wx-2,y+2,2  ,33 ,WHITE);

       	while( HAL_GPIO_ReadPin(TP_IRQ_GPIO_Port, TP_IRQ_Pin) == 0 );

       	HAL_Delay(255);

    	FillReg(x+2,y+2,wx-2,35,colorF);
    	ILI9341_Draw_String(xt,yt,colorT,colorF,str,4);
   		FillReg(x   ,y	 ,wx  ,2  ,BLACK);
   		FillReg(x	,y	 ,2	  ,37 ,BLACK);
   		FillReg(x+wx,y	 ,2	  ,37 ,BLACK);
   		FillReg(x	,y+35,wx  ,2  ,BLACK);
   		FillReg(x+2 ,y+2 ,wx-4,2  ,WHITE);
   		FillReg(x+2	,y+2 ,2	  ,33 ,WHITE);
   		HAL_Delay(55);
    	break;
    }
}




//////////////////////////////////////////////////////////
// SPI
//////////////////////////////////////////////////////////
uint8_t SPI_TransmitReceive(SPI_HandleTypeDef *hspi, uint8_t Data)
{//Transmit Receive 1 byte
  *(__IO uint8_t *)&hspi->Instance->DR=Data;
  if(__HAL_SPI_GET_FLAG(hspi, SPI_FLAG_RXNE))
	  return *(__IO uint8_t *)&hspi->Instance->DR;
  return 0;
}

void SPI_TxByte(uint8_t data)
{//Transmit 1 byte
	SPI_TransmitReceive(&SD_SPI_HANDLE,data);
}

uint8_t SPI_RxByte(void)
{//Receive 1 byte
	uint8_t data=0xFF;
	return SPI_TransmitReceive(&SD_SPI_HANDLE,data);
}
void SPI_RxBytePtr(uint8_t *buff)
{
  *buff = SPI_RxByte();
}
//////////////////////////////////////////////////////////
// SD
//////////////////////////////////////////////////////////
unsigned char  readSD1(FIL* fp);
HAL_StatusTypeDef SPI_Transmit(SPI_HandleTypeDef *hspi, uint8_t *pData, uint16_t Size, uint32_t Timeout);
DWORD clmt_clustSD (	/* <2:Error, >=2:Cluster number */
	FIL* fp,		/* Pointer to the file object */
	DWORD ofs		/* File offset to be converted to cluster# */
);
void mem_cpySD(void* dst, const void* src, UINT cnt);

extern FIL fil;
extern FATFS fs;
extern FATFS *pfs;

unsigned long m_PosFlashSD=0;
unsigned long m_PosFlashST=0;
unsigned long m_PosBK;

unsigned char LeerSDAbs(unsigned long Pos);
unsigned char LeerSDRel();



void StaticBox(unsigned int x,unsigned int y,unsigned char LargoBoton,char* str);
void StaticBox2(unsigned int x,unsigned int y,unsigned char Est,unsigned char LargoBoton,char* str,char* tit);

unsigned long	ReconocerInt(char *chr);
unsigned long	ReconocerFnInt(char *chr);
unsigned long	ResolverInt(char *chr);
double			ReconocerDouble(char *chSal);
double			ReconocerFnDouble(char* chSal);
double			ResolverDouble(char* orig);
unsigned long	ReconocerString(char* str,char ChSalida);

unsigned char 	TextOut(unsigned int x,unsigned int y,char *a);

unsigned char BOR(unsigned char fil,unsigned char col,unsigned char mo,char* a);

void DibujarTeclasFlechas(void);
void FondoTeclas(void);
void CalculoXY(void);

void PIC(unsigned char* ID,unsigned int x,unsigned int y,unsigned char Brillo)
{
	uint32_t	ii;
	uint16_t    cRGB[256],R,G,B,RGB;
	unsigned char data[512];
	unsigned int q,c,d,i;

	m_Memoria=ID;

	TP_CS_OFF;
	SD_CS_OFF;
	TFT_CS_ON;
	ILI9341_Set_Rotation(4);

	uint32_t AnchoBMP=LeerFlashAbs(0)<<8;
	AnchoBMP=AnchoBMP | LeerFlashRel();
	uint32_t AltoBMP = LeerFlashRel()<<8;
	AltoBMP=AltoBMP | LeerFlashRel();
	uint32_t Peso=AnchoBMP*AltoBMP;

	//sprintf(data,"Ancho %d Alto %d",AnchoBMP,AltoBMP);
	//ILI9341_Draw_String(0,80,WHITE,0x0010,data,4);

	LeerFlashRel();
	LeerFlashRel();
	LeerFlashRel();

	uint32_t LargoTablaColores= LeerFlashRel();
	if(LargoTablaColores==0) 	LargoTablaColores=256;

	for(i=0;i<LargoTablaColores;i++)
	{
		cRGB[i]=(uint16_t)LeerFlashRel()<<8;
		cRGB[i]=cRGB[i] | LeerFlashRel();

		if(Brillo !=0 )
		{
			R=cRGB[i]>>11;
			G=cRGB[i]>>5 & 0x3F;
			B=cRGB[i] & 0x1F;

			if((R+Brillo)<0x1F) R=R+Brillo;
			else			  	R=0x1f;
			if((G+Brillo)<0x3F) G=G+Brillo;
			else			  	G=0x3f;
			if((B+Brillo)<0x1F) B=B+Brillo;
			else			  	B=0x1f;
			cRGB[i]=R*2048+G*32+B;
			RGB==R*2048+G*32+B;

			//sprintf(data,"%X %X %X %X",R,G,B,RGB);
			//ILI9341_Draw_String(0,80,WHITE,0x0010,data,4);
		}
	}

	unsigned int x1=x;
	unsigned int y1=240-(unsigned int)AltoBMP-y;
	unsigned int x2=AnchoBMP+x-1;
	unsigned int y2=239-y;
	ILI9341_Set_Address(x1,y1,x2,y2);

	TFT_DC_COMMAND;
	data[0]=0x2C;
	HAL_SPI_Transmit(&lcd_spi, data, 1, 1);

