nataliurena1985/STM32dab/Recursos/Recursos.c
	ii=0;
	do
	{
		q=LeerFlashRel();
		c=LeerFlashRel();
		for(i=0;i<q*2;i++)
		{
			data[i]=(uint8_t)(cRGB[c]>>8);
			i++;
			data[i]=(uint8_t)(cRGB[c] & 0x00FF);
		}
		TFT_DC_DATA;
		HAL_SPI_Transmit(&lcd_spi,data,q*2,100);
		ii=ii+q;

	}while(ii<Peso);

//	sprintf(data,"%X %X %X %X",R,G,B,RGB);
//	ILI9341_Draw_String(0,80,WHITE,0x0010,data,4);

	TFT_CS_OFF;
}

void f_BMP(char* File,unsigned int x,unsigned int y)
{
	uint32_t		i,ii,iii;
	uint8_t    		dataOut[512];
	unsigned char 	dataIn[256],color[4],c;
	unsigned int 	col_16,TablaCol[256];
	UINT 			br,ERROR_SD;
	FIL Fil;

	TP_CS_OFF;
	TFT_CS_OFF;
	SD_CS_ON;

	f_open(&Fil,File,FA_READ);
	f_read(&Fil,dataIn,54,&br);

	uint32_t	AnchoBMP=(unsigned int)dataIn[0x12]+(unsigned int)dataIn[0x13]*256;
	uint32_t	AltoBMP=(unsigned int)dataIn[0x16]+(unsigned int)dataIn[0x17]*256;
	uint32_t	OffsetArray=(unsigned int)dataIn[0x0A]+(unsigned int)dataIn[0x0B]*256;
	uint32_t	LargoTablaColores=(unsigned int)dataIn[0x2E]+(unsigned int)dataIn[0x2F]*256;

	for(i=0;i<LargoTablaColores;i++)
	{
		f_read(&Fil,color,4,&br);
		TablaCol[i]=(color[2]/8)*2048+(color[1]/4)*32+(color[0])/8;
	}

	f_lseek(&Fil,OffsetArray);
	uint32_t Peso=AnchoBMP*AltoBMP;

	SD_CS_OFF;
	TFT_CS_ON;
	ILI9341_Set_Rotation(4);
	unsigned int x1=x;
	unsigned int y1=240-(unsigned int)AltoBMP-y;
	unsigned int x2=AnchoBMP+x-1;
	unsigned int y2=239-y;
	ILI9341_Set_Address(x1,y1,x2,y2);
	TFT_DC_COMMAND;
	dataIn[0]=0x2C;
	HAL_SPI_Transmit(&lcd_spi, dataIn, 1, 1);
	TFT_CS_OFF;
	DWORD sect ;

	for(i=0;i<Peso;i=i+256)
	{
		TFT_CS_OFF;
		SD_CS_ON;

		f_read(&Fil,dataIn,256,&br);
		for(ii=0,iii=0;ii<256;ii++,iii++)
		{
			dataOut[iii]=TablaCol[dataIn[ii]]>>8;
			iii++;
			dataOut[iii]=TablaCol[dataIn[ii]];
		}
		SD_CS_OFF;
		TFT_CS_ON;
		TFT_DC_DATA;
		HAL_SPI_Transmit(&lcd_spi,dataOut,512,100);
		TFT_CS_OFF;
	}
	TFT_CS_OFF;
	SD_CS_ON;
	f_close(&Fil);
	SD_CS_OFF;

}


void FillReg(unsigned int x,unsigned int y,
			 unsigned int wx,unsigned int wy,
			 unsigned int color)
{
	SD_CS_OFF;
	TFT_CS_ON;

	uint16_t	i;
	uint32_t	Peso=wx*wy;

	uint8_t data[640];

	ILI9341_Set_Rotation(4);
	unsigned int x1=x;
	unsigned int y1=240-wy-y;
	unsigned int x2=wx+x-1;
	unsigned int y2=239-y;
	ILI9341_Set_Address(x1,y1,x2,y2);

	TFT_DC_COMMAND;
	data[0]=0x2C;
	HAL_SPI_Transmit(&lcd_spi, data, 1, 1);

	for(i=0;i<wx;i++)
	{
			data[i*2]=color>>8;
			data[i*2+1]=color & 0xff;
	}

	TFT_DC_DATA;
	for(i=0;i<wy;i++)
	{
		HAL_SPI_Transmit(&lcd_spi,data,wx*2,10);
	}

}


void PrintCentrado( unsigned char* Titulo,
                    unsigned char y,
                    unsigned int ColorChar,
                    unsigned int ColorFondo
                   )
{
    uint16_t x=(22-(unsigned char)strlen(Titulo))/2;
    ILI9341_Draw_String(x*14, y, ColorChar,ColorFondo,Titulo,4);
}

void FondoCartel(  unsigned char Y,unsigned int ColorFondo)
{
	FillReg(31,Y,280,Y+80,0x0000);
	FillReg(33,Y+2,278,Y+78,ColorFondo);
}
void AtencionTecladoNumerico()
{
    //asmAtencionTecladoNumerico();
}
void Encabezamiento3(char* str)
{
	FillReg(0,0,319,33,0x0010);
    uint16_t x=(22-(unsigned char)strlen(str))/2;
    ILI9341_Draw_String(x*14+7, 0, WHITE, 0x0010, str, 4);
}
void GraficarPWM(void)
{
}

void GraficarOSC(void)
{
  SD_CS_OFF;
  TFT_CS_ON;

  uint16_t i,x;
  uint8_t data[500];
  uint32_t ya0,yp0,ya1,yp1,ya2,yp2,ya3,yp3;

  ILI9341_Set_Rotation(0);
  ILI9341_Set_Address(0,0,239,319);

  TFT_DC_COMMAND;
  data[0]=0x2c;
  HAL_SPI_Transmit(&lcd_spi,data,1,10);
  TFT_DC_DATA;
  for(x=0;x<320;x++)
  {
	  if(x==0||x==50||x==100||x==150||x==200||x==250||x==300)  for(i=0;i<480;i=i+2) data[i]=0xff,data[i+1]=0xff;
	  else for(i=0;i<480;i=i+2) data[i]=0x064,data[i+1]=0xDF;

	  if(x<=300)
	  {
		  data[0]=0xff;
		  data[1]=0xff;
		  data[80]=0xff;
		  data[81]=0xff;
		  data[160]=0xff;
		  data[161]=0xff;
		  data[240]=0xff;
		  data[241]=0xff;
		  data[320]=0xff;
		  data[321]=0xff;
		  data[400]=0xff;
		  data[401]=0xff;
		  data[479]=0xff;
		  data[480]=0xff;
	  }

	  ya0=(OSCCanal1[x]/120+40)*2;
	  yp0=(OSCCanal1[x+1]/120+40)*2;

	  ya1=(OSCCanal2[x]/120+80)*2;
	  yp1=(OSCCanal2[x+1]/120+80)*2;

	  ya2=(OSCCanal3[x]/120+120)*2;
	  yp2=(OSCCanal3[x+1]/120+120)*2;

	  ya3=(OSCCanal4[x]/120+160)*2;
	  yp3=(OSCCanal4[x+1]/120+160)*2;

	  if(yp0>ya0) for(i=ya0;i<=yp0 & i<480;i=i+2) data[i]=RED>>8, data[i+1]=RED;
	  else for(i=yp0;i<=ya0 & i<480;i=i+2) data[i]=RED>>8, data[i+1]=RED;

	  if(yp1>ya1) for(i=ya1;i<=yp1 & i<480;i=i+2) data[i]=DARKGREEN>>8, data[i+1]=DARKGREEN;
	  else for(i=yp1;i<=ya1 & i<480;i=i+2) data[i]=DARKGREEN>>8, data[i+1]=DARKGREEN;

	  if(yp2>ya2) for(i=ya2;i<=yp2 & i<480;i=i+2) data[i]=YELLOW>>8, data[i+1]=YELLOW;
  	  else for(i=yp2;i<=ya2 & i<480;i=i+2) data[i]=YELLOW>>8, data[i+1]=YELLOW;

	  if(yp3>ya3) for(i=ya3;i<=yp3 & i<480;i=i+2) data[i]=PURPLE>>8, data[i+1]=PURPLE;
  	  else for(i=yp3;i<=ya3 & i<480;i=i+2) data[i]=PURPLE>>8, data[i+1]=PURPLE;

	  HAL_SPI_Transmit(&lcd_spi,data,480,10);
  }
}


void DPM( unsigned char* ID,
          unsigned int x,
          unsigned int y,
          unsigned char Signo,
          unsigned int Valor,
          unsigned char LargoEnPixeles,
          unsigned char offset,
          unsigned char QChar,
          unsigned int ColorChar,
          unsigned int ColorBk,
          unsigned char Pto,
          unsigned char ST)
{
  //asm bclr 1,KBISC
  //Reg1=(unsigned char)(x & 0x00FF);//;XL  Start
  //Reg2=(unsigned char)(x >>8);//;XH
  //Reg3=(unsigned char)(y & 0x00FF);//;YL  Start
  //Reg33=(unsigned char)(y >>8);//;YH
  //Reg4=LargoEnPixeles;
  //Reg5=(unsigned char)(ColorChar & 0x00FF);//;L
  //Reg6=(unsigned char)(ColorChar >>8);//;H
  //Reg7=(unsigned char)(ColorBk & 0x00FF);//;L
  //Reg8=(unsigned char)(ColorBk >>8);//;H
  //Reg9=(unsigned char)(Valor & 0x00FF);//;L
  //Reg10=(unsigned char)(Valor >>8);//;H
  //Reg11=QChar;//4 máximo    1 mínimo
  //Reg12=Pto;//lugar del punto  0=sin punto 1=0.0  2=0.00  3=0.000
  //Reg13=ST;//0  primera vez  /  //Reg13>0 imprimir valor
  //Reg14=offset;//0  primera vez  /  //Reg13>0 imprimir valor
  ////Param3=ID[0];
  ////Param2=ID[1];
  ////Param1=ID[2];
  //asm bset 1,KBISC
  //asmDPM();
}

void Fondo()
{
}

void FondoAzul()
{
	FillReg(0,0,319,202,0x64DF);//azul
}
void FondoBlanco()
{
	FillReg(0,0,319,200,WHITE);
}
void FondoTeclas()
{
	FillReg(0,200,319,39,0x64DF);//azul
}
void FondoCompletoAzul()
{
	FillReg(0,0,320,240,0x64DF);//azul
}

