nataliurena1985/STM32dab/Recursos/Recursos.c
void DibujarTeclasFlechas()
{
	char str[4];

	FondoTeclas();
	str[0]='<';//0xA4;
	str[1]='-';//0xA5;
	str[2]=0;
	BOW(4,205,0,5,str);

	str[0]='+';//0xA6;
	str[1]=' ';//0xA7;
	str[2]=0;
	BOW(84,205,0,5,str);

	str[0]='-';//0xA8;
	str[1]=' ';//0xA9;
	str[2]=0;
	BOW(164,205,0,5,str);

	str[0]='-';//0xA5;
	str[1]='>';//0xA3;
	str[2]=0;
	BOW(244,205,0,5,str);
}


void Graficar(unsigned int x,unsigned int y,unsigned int orix,unsigned int oriy,unsigned int color)
{
	SD_CS_OFF;
	TFT_CS_ON;
	ILI9341_Set_Rotation(4);
	ILI9341_Draw_Pixel(orix+x,oriy-y,color);
}
void DPMChico(unsigned int x,unsigned int y,unsigned char LargoBoton,unsigned int ColorFont,unsigned int ColorFondo,char* str)
{

	SD_CS_OFF;
	TFT_CS_ON;

	ILI9341_Set_Rotation(4);

    uint16_t xt=x+2+(LargoBoton-(unsigned char)strlen(str))*7;
    uint16_t yt=y+3;
    uint16_t wx=LargoBoton*14;
    uint16_t wy=35;

    FillReg(x+2,y+2,wx-2,35,ColorFondo);
   	ILI9341_Draw_String(xt,yt,ColorFont,ColorFondo,str,4);
   	FillReg(x   ,y	 ,wx  ,2  ,0);
   	FillReg(x	,y	 ,2	  ,37 ,0);
   	FillReg(x+wx,y	 ,2	  ,37 ,0);
   	FillReg(x	,y+35,wx  ,2  ,0);
}

void StaticBox(unsigned int x,unsigned int y,unsigned char LargoBoton,char* str)
{
    uint16_t xt=x+2+(LargoBoton-(unsigned char)strlen(str))*7;
    uint16_t yt=y+3;
    uint16_t wx=LargoBoton*14;
    uint16_t wy=35;

    FillReg(x+2,y+2,wx-2,35,WHITE);
   	ILI9341_Draw_String(xt,yt,BLACK,WHITE,str,4);
   	FillReg(x   ,y	 ,wx  ,2  ,BLACK);
   	FillReg(x	,y	 ,2	  ,37 ,BLACK);
   	FillReg(x+wx,y	 ,2	  ,37 ,BLACK);
   	FillReg(x	,y+35,wx  ,2  ,BLACK);
}

void StaticBox2(unsigned int x,unsigned int y,unsigned char Est,unsigned char Largo,char* str,char* tit)
{
	uint16_t xt=x+((Largo-(unsigned char)strlen(tit))/2)*7+36;
    uint16_t yt=y-3;

    if(Est==0)  BOT(BOT_AIZQ,x,y+16,0),BOT(BOT_ADER,x+39+14*Largo,y+16,0);
    if(Est==1)  BOT(BOT_AIZQ,x,y+16,2);
    if(Est==2)  BOT(BOT_ADER,x+39+14*Largo,y+16,2);

	ILI9341_Draw_String(x,y, WHITE, 0x0010,tit,2);
	StaticBox(x+35,y+17,Largo,str);
}

unsigned char  StaticBox2_Activo(unsigned int x,unsigned int y,unsigned char LargoBoton)
{
    if
    (
      (m_XPanel>x && m_XPanel<(x+14*LargoBoton+37) )
      &&
      (m_YPanel>y && m_YPanel<(y+62) )
    ) return 1;

    if
    (
       (m_XPanel>(x+14*LargoBoton+37) && m_XPanel<(x+14*LargoBoton+74) )
       &&
       (m_YPanel>y && m_YPanel<(y+62) )
    ) return 2;

    return 0;
}

unsigned char  Zona_Activo(unsigned int x1,unsigned int y1,unsigned int x2,unsigned int y2)
{
    if
    (
      (m_XPanel>x1 && m_XPanel<x2)
      &&
      (m_YPanel>y1 && m_YPanel<y2)
    ) return 1;
    return 0;
}

unsigned char  BOW_Activo(unsigned int x,unsigned int y,unsigned char LargoBoton)
{
    if
    (
      (m_XPanel>x && m_XPanel<(x+7+14*LargoBoton ) )
      &&
      (m_YPanel>y && m_YPanel<(y+30 ) )
    ) return 1;
    else return 0;
}
unsigned char  BOR_Activo(unsigned int fil,unsigned int col,unsigned char LargoBoton)
{
	return BOW_Activo(col*14,38*fil,LargoBoton*14);
}

unsigned char  BOT_Activo(unsigned char* ID,unsigned int x,unsigned int y)
{
	int	AnchoBMP=(unsigned int)ID[0]*256+(unsigned int)ID[1];
	int AltoBMP=(unsigned int)ID[2]*256+(unsigned int)ID[3];
    if
    (
      (m_XPanel>x && m_XPanel<(x+AnchoBMP) )
      &&
      (m_YPanel>y && m_YPanel<(y+AltoBMP) )
    ) return 1;
    else return 0;
}

unsigned char  BTT_Activo(unsigned char* ID,unsigned int x,unsigned int y,unsigned char Est)
{
    if(Est==0)
    {
        if
        (
            (m_XPanel>x && m_XPanel<(x+ID[0]) )
            &&
            (m_YPanel>y && m_YPanel<(y+ID[1]/2) )
        )   return 1;
        else return 0;
    }
    else
    {
        if
        (
            (m_XPanel>x && m_XPanel<(x+ID[0]) )
            &&
            (m_YPanel>(y+ID[1]/2) && m_YPanel<(y+ID[1]) )
        )   return 1;
        else return 0;
    }
}

void PEL(unsigned char* ID,unsigned int x,unsigned int y,unsigned char Esc)
{
    unsigned int xx;
    unsigned int yy;

    if(Esc==0)
    {
      xx=x;
      yy=y;
    }
    else
    {
      xx=x+ID[1];
      yy=y+ID[2];

    }
    f_PIC(&ID[3+3*Esc],xx,yy);
}

void CalcularMyB(void)
{/*
    Mx= 256./(((XXXXH*256)+XXXXL)-((//Reg18*256)+//Reg17));
    My= 136./(((YYYYH*256)+YYYYL)-((//Reg20*256)+//Reg19));
    Bx= 32.5-(Mx * ((//Reg18*256)+//Reg17));
    By= 44.5-(My * ((//Reg20*256)+//Reg19));*/
}


/////////////////////
// MEMORIA SD
/////////////////////
unsigned char LeerSDAbs(unsigned long Pos)
{
	TFT_CS_OFF;
	SD_CS_ON;
	m_PosFlashSD=Pos;
	f_lseek(&fil,m_PosFlashSD);
	m_PosFlashSD++;
	return readSD1(&fil);
}
unsigned char LeerSDRel()
{
	TFT_CS_OFF;
	SD_CS_ON;
	m_PosFlashSD++;
	return readSD1(&fil);
}
unsigned char readSD1(FIL* fp)
{
	DWORD clst, sect;
	UINT rcnt;
	BYTE csect,a;

	if ((fp->fptr % 512) == 0)
	{/* On the sector boundary? */
		csect = (BYTE)(fp->fptr / 512 & (fp->fs->csize - 1));	/* Sector offset in the cluster */
		if (!csect)
		{/* On the cluster boundary? */
			if (fp->fptr == 0)
			{/* On the top of the file? */
				clst = fp->sclust;/* Follow from the origin*/
			}
			else
			{/* Middle or end of the file */
				if (fp->cltbl) clst = clmt_clustSD(fp, fp->fptr);/*Get cluster# from the CLMT */
				else		   clst = get_fat(fp->fs, fp->clust);/*Follow cluster chain on the FAT*/
			}
			fp->clust = clst;	/* Update current cluster */
		}
		sect = clust2sect(fp->fs,fp->clust);	/* Get current sector */

		sect += csect;
		if (fp->dsect != sect)
		{/* Load data sector if not in cache */
			if (fp->flag & FA__DIRTY)
			{/* Write-back dirty sector cache */
				disk_write(fp->fs->drv, fp->buf.d8, fp->dsect, 1);
				fp->flag &= ~FA__DIRTY;
			}
			disk_read(fp->fs->drv, fp->buf.d8, sect, 1) ;
		}
		fp->dsect = sect;
	}
	a=fp->buf.d8[fp->fptr % 512];
	fp->fptr++;
	return a;
}
DWORD clmt_clustSD(	/* <2:Error, >=2:Cluster number */
	FIL* fp,		/* Pointer to the file object */
	DWORD ofs		/* File offset to be converted to cluster# */
)
{
	DWORD cl, ncl, *tbl;

	tbl = fp->cltbl + 1;	/* Top of CLMT */
	cl = ofs / 512 / fp->fs->csize;	/* Cluster order from top of the file */
	for (;;) {
		ncl = *tbl++;			/* Number of cluters in the fragment */
		if (!ncl) return 0;		/* End of table? (error) */
		if (cl < ncl) break;	/* In this fragment? */
		cl -= ncl; tbl++;		/* Next fragment */
	}
	return cl + *tbl;	/* Return the cluster number */
}

/////////////////////////////
// FUNCIONES SOBRE SD
/////////////////////////////
double	s(long renglon,long pos);
double	r(long renglon,long pos);
double	t(long renglon,long pos);
double	l(long renglon,long puntero);
double	um(double ref,double dato);
double	us(double ref,double dato);
double	ul(double ref,double dato);
double	CA2(double valor);
long	G();
long	H(long pos);
long	L(long pos);
long	I(long pos);
long	UM(long ref,long dato);
long	US(long ref,long dato);
long	UL(long ref,long dato);
long	BI(long renglon,long puntero);
void	TeclaArriba();
void	TeclaAbajo();
void	TeclaAtras();
void	TeclaAdelante();

unsigned long ReconocerString(char* str1,char ChSalida)
{
	unsigned long col=0;

	do
	{
		str1[col]=LeerSDRel();
		col++;

	}while(	str1[col-1]!=ChSalida && str1[col-1]!=0);
	str1[col-1]=0;
	return col;
}

