nataliurena1985/STM32dab/Recursos/Recursos.c
unsigned long ReconocerInt(char *chr)
{

	unsigned long Decimal=1,P0=0;
	char ch;
	do
	{
		ch=LeerSDRel();

		if(ch=='x') Decimal=0,P0=0;
		if(ch=='X') Decimal=0,P0=0;
		if
		(
			Decimal==0	&&
			(
				(ch>=0x30 && ch<=0x39)	||
				ch=='a'	|| ch=='A'	||
				ch=='b'	|| ch=='B'	||
				ch=='c'	|| ch=='C'	||
				ch=='d'	|| ch=='D'	||
				ch=='e'	|| ch=='E'	||
				ch=='f'	|| ch=='F'
			)
		)
		{
			if(ch=='a'||ch=='A') P0=P0*16+10;
			if(ch=='b'||ch=='B') P0=P0*16+11;
			if(ch=='c'||ch=='C') P0=P0*16+12;
			if(ch=='d'||ch=='D') P0=P0*16+13;
			if(ch=='e'||ch=='E') P0=P0*16+14;
			if(ch=='f'||ch=='F') P0=P0*16+15;
   			if((ch>=0x30 && ch<=0x39)) P0=P0*16+(long)ch-0x30;
		}
		if
		(
			Decimal==1 &&
			ch>=0x30 &&
			ch<=0x39

		)	P0=P0*10+(long)ch-0x30;

	}while
	(
		(ch>=0x30 && ch<=0x39) ||
		ch=='a'	|| 	ch=='b'	||	ch=='c'	||
    	ch=='d'	||	ch=='e'	||	ch=='f'	||
		ch=='A'	|| 	ch=='B'	||	ch=='C'	||
		ch=='D'	||	ch=='E'	||	ch=='F'	||
		ch=='x'	||	ch=='X'	||	ch==' '
	);
	*chr=ch;
	return P0;
}

unsigned long ReconocerFnInt(char *chr)
{
	unsigned long fin=0,i=0,P0,P1,S;
		char ch;

		if((S=ReconocerInt(&ch))==0)
		{
			if(ch=='U')
			{
				ch=LeerSDRel();
				if(ch=='M')
				{
					ch=LeerSDRel();
					P0=ResolverInt(&ch);
					P1=ResolverInt(&ch);
					S=UM(P0,P1);
					ch=LeerSDRel();
					*chr=ch;
					return S;
				}
				if(ch=='S')
				{
					ch=LeerSDRel();
					P0=ResolverInt(&ch);
					P1=ResolverInt(&ch);
					S=US(P0,P1);
					ch=LeerSDRel();
					*chr=ch;
					return S;
				}
				if(ch=='L')
				{
					ch=LeerSDRel();
					P0=ResolverInt(&ch);
					P1=ResolverInt(&ch);
					S=UL(P0,P1);
					ch=LeerSDRel();
					*chr=ch;
					return S;
				}
			}

			if(ch=='I')
			{
				ch=LeerSDRel();
				P0=ResolverInt(&ch);
				S=I(P0);
				ch=LeerSDRel();
				*chr=ch;
		 		return S;
			}
			if(ch=='H')
			{
				ch=LeerSDRel();
				P0=ResolverInt(&ch);
				S=H(P0);
				ch=LeerSDRel();
				*chr=ch;
		 		return S;
			}
			if(ch=='L')
			{
				ch=LeerSDRel();
				P0=ResolverInt(&ch);
				S=L(P0);
				ch=LeerSDRel();
				*chr=ch;
		 		return S;
			}

			if(ch=='G')
			{
				ch=LeerSDRel();
				S=G();
				ch=LeerSDRel();
				*chr=ch;
		 		return S;
			}

			if(ch=='(')
			{
				S=ResolverInt(&ch);
				ch=LeerSDRel();
				*chr=ch;
		 		return S;
			}
		}
		*chr=ch;
 		return S;
}

unsigned long	ResolverInt(char *chr)
{
	unsigned long	T,ST,in=0;
	char ch;

	ST=ReconocerFnInt(&ch);
	T=0;

	do
	{

		if(ch=='&')	ST=ST&ReconocerFnInt(&ch);
		if(ch=='|')	ST=ST|ReconocerFnInt(&ch);
		if(ch=='*')	ST=ST*ReconocerFnInt(&ch);
		if(ch=='/')	ST=ST/ReconocerFnInt(&ch);
		if(ch=='+')	T=T+ST,ST=ReconocerFnInt(&ch);
		if(ch=='-')	T=T+ST,ST=-ReconocerFnInt(&ch);
		if(ch==')' || ch==',')	T=T+ST;

	}while(ch!=',' && ch!=')');

	*chr=ch;

	return T;
}

double ReconocerDouble(char *chSal)
{

			long Decimal=1,fr=0,frs=0,i;
			double	P0=0;
			char ch;
			do
			{
				ch=LeerSDRel();

				if(ch=='x') Decimal=0,P0=0;
				if(ch=='X') Decimal=0,P0=0;
				if(ch=='.') fr=1;
				if
				(
					Decimal==0	&&
					(
						(ch>=0x30 && ch<=0x39)	||
						ch=='a'	|| ch=='A'	||
						ch=='b'	|| ch=='B'	||
						ch=='c'	|| ch=='C'	||
						ch=='d'	|| ch=='D'	||
						ch=='e'	|| ch=='E'	||
						ch=='f'	|| ch=='F'
					)
				)
				{
					if(ch=='a'||ch=='A') P0=P0*16+10;
					if(ch=='b'||ch=='B') P0=P0*16+11;
					if(ch=='c'||ch=='C') P0=P0*16+12;
					if(ch=='d'||ch=='D') P0=P0*16+13;
					if(ch=='e'||ch=='E') P0=P0*16+14;
					if(ch=='f'||ch=='F') P0=P0*16+15;
					if((ch>=0x30 && ch<=0x39)) P0=P0*16+(long)ch-0x30;

					if(fr==1) frs++;
				}
				if
				(
					Decimal==1 &&
					ch>=0x30 &&
					ch<=0x39
				)
				{
					P0=P0*10+(long)ch-0x30;
					if(fr==1) frs++;
				}

			}while
			(
				(ch>=0x30 && ch<=0x39) ||
				ch=='a'	|| 	ch=='b'	||	ch=='c'	||
				ch=='d'	||	ch=='e'	||	ch=='f'	||
				ch=='A'	|| 	ch=='B'	||	ch=='C'	||
				ch=='D'	||	ch=='E'	||	ch=='F'	||
				ch=='x'	||	ch=='X'	||	ch==' '	||
				ch=='.'
			);
			*chSal=ch;

			for(i=frs;i>0 && Decimal==1;i--) P0=P0/10;
			for(i=frs;i>0 && Decimal==0;i--) P0=P0/16;

			return P0;
}
double	ReconocerFnDouble(char *chr)
{
		long	fin=0,i=0,P0,P1;
		double	R0,R1;
		double S;
		char ch;

		if((S=ReconocerDouble(&ch))==0)
		{
			if(ch=='s')
			{
				ch=LeerSDRel();
				P0=ResolverInt(&ch);
				P1=ResolverInt(&ch);
				S=s(P0,P1);
				ch=LeerSDRel();
			}
			if(ch=='r')
			{
				ch=LeerSDRel();
				P0=ResolverInt(&ch);
				P1=ResolverInt(&ch);
				S=r(P0,P1);
				ch=LeerSDRel();
			}
			if(ch=='t')
			{
				ch=LeerSDRel();
				P0=ResolverInt(&ch);
				P1=ResolverInt(&ch);
				S=t(P0,P1);
				ch=LeerSDRel();
			}
			if(ch=='p')
			{
				ch=LeerSDRel();
				P0=ResolverInt(&ch);
				S=p(P0);
				ch=LeerSDRel();
			}

			if(ch=='u')
			{
				ch=LeerSDRel();
				if(ch=='m')
				{
					ch=LeerSDRel();
					R0=ResolverDouble(&ch);
					R1=ResolverDouble(&ch);
					S=um(R0,R1);
					ch=LeerSDRel();
				}
				if(ch=='s')
				{
					ch=LeerSDRel();
					R0=ResolverDouble(&ch);
					R1=ResolverDouble(&ch);
					S=us(R0,R1);
					ch=LeerSDRel();
				}
				if(ch=='l')
				{
					ch=LeerSDRel();
					R0=ResolverDouble(&ch);
					R1=ResolverDouble(&ch);
					S=ul(R0,R1);
					ch=LeerSDRel();
				}
			}
			if(ch=='l')
			{
				ch=LeerSDRel();
				P0=ResolverInt(&ch);
				P1=ResolverInt(&ch);
				S=l(P0,P1);
				ch=LeerSDRel();
			}
			if(ch=='(')
			{
				S=ResolverDouble(&ch);
				ch=LeerSDRel();
			}
		}

		*chr=ch;
		return S;
}

double	ResolverDouble(char *chr)
{
	double	T,ST;
	char ch;

	ST=ReconocerFnDouble(&ch);
	T=0;
	do
	{
		if(ch=='*')	ST=ST*ReconocerFnDouble(&ch);
		if(ch=='/')	ST=ST/ReconocerFnDouble(&ch);
		if(ch=='+')	T=T+ST,ST=ReconocerFnDouble(&ch);
		if(ch=='-')	T=T+ST,ST=-ReconocerFnDouble(&ch);
		if(ch==')' || ch==',')	T=T+ST;

	}while(ch!=',' && ch!=')');

	*chr=ch;

	return T;
}

unsigned char TextOut(unsigned int x,unsigned int y,char *a)
{
	ILI9341_Draw_String(x,y,WHITE,0x643F,a,4);
	return 0;
}

unsigned char Display(unsigned char fila,unsigned char columna,unsigned char modo, char *a)
{
    unsigned int  x,y,anch_car,anch_ren;
    unsigned int  ColorCaracter,ColorFondo;
    int   pt=0,i;
    char  code_char, resalte;
    unsigned int  coli;

    anch_car=14;
    anch_ren=24;

    x=(unsigned int)columna*anch_car;
    y=240-(unsigned int)fila*anch_ren+5;

    switch (modo)
    {
            case 0:
            ColorCaracter=0xFFFF;
            ColorFondo=0x64DF;

            for(pt=0;pt!=23 && a[pt]!=0; pt++)   /*envío los datos al display*/
            {
                code_char = a[pt];
                if (x<320 && y<180)
                ILI9341_Draw_Char(x,y,ColorCaracter,ColorFondo,code_char,4);
                x=x+anch_car;
            }
            for(;pt!=23; pt++)   /*envío los datos al display*/
            {
                code_char = 0x20;
                if (x<320 && y<180) ILI9341_Draw_Char(x,y,ColorCaracter,ColorFondo,code_char,4);
                x=x+anch_car;
            }
            break;

            case 1:
            ColorCaracter=0x001F;
            ColorFondo=0xFFFF;

            for(pt=0;pt!=23 && a[pt]!=0; pt++)   /*envío los datos al display*/
            {
                code_char = a[pt];
                if (x<320 && y<180) ILI9341_Draw_Char(x,y,ColorCaracter,ColorFondo,code_char,4);
                x=x+anch_car;
            }
            for(;pt!=23; pt++)   /*envío los datos al display*/
            {
                code_char = 0x20;
                if (x<320 && y<180) ILI9341_Draw_Char(x,y,ColorCaracter,ColorFondo,code_char,4);
                x=x+anch_car;
            }
            break;

