nataliurena1985/STM32dab/Recursos/Recursos.c
            case 2:
            ColorCaracter=0xFFFF;
            ColorFondo=0x64DF;

            do
            {
                code_char = a[pt];
                if (x<320 && y<180) ILI9341_Draw_Char(x,y,ColorCaracter,ColorFondo,code_char,4);
                columna++;

                if ( (columna>18 && a[pt]==0x20) || columna>21)
                {
                    fila++;
                    columna=0;
                }
                x=(unsigned int) columna*anch_car;
                y=(unsigned int) fila*anch_ren+5;
                pt++;

            }while  (a[pt]!=0 && fila<8);
            break;

            case 3:
            ColorCaracter=0xFFFF;
            ColorFondo=0x64DF;

            do
            {
                x=(unsigned int)columna*anch_car;
                y=(unsigned int)fila*anch_ren+5;
                code_char = a[pt];
                if(code_char!=0 && x<320 && y<180) ILI9341_Draw_Char(x,y,ColorCaracter,ColorFondo,code_char,4);
                if(code_char==0 && x<320 && y<180) ILI9341_Draw_Char(x,y,ColorCaracter,ColorFondo,0x20,4);
                pt++;
                columna++;
                if( (columna>18 && a[pt]==0x20) || columna>21 || a[pt]==0)
                {
                    for(i=columna;i<23;i++)
                    {
                        x=(unsigned int)i*anch_car;
                        if(x<320 && y<180) ILI9341_Draw_Char(x,y,ColorCaracter,ColorFondo,code_char,4);
                    }
                    columna=0;
                    if(a[pt]==0x20) pt++;
                    if(a[pt]!=0) fila++;
                }

            }while( a[pt]!=0 && fila<9 );
            break;

            case 4:
            ColorCaracter=0xfFf0;
            ColorFondo=0x00f0;

            for(pt=0;pt!=23 && a[pt]!=0; pt++)   /*envío los datos al display*/
            {
                code_char = a[pt];
                if (x<320 && y<180) ILI9341_Draw_Char(x,y,ColorCaracter,ColorFondo,code_char,4);
                x=x+anch_car;
            }
            for(;pt!=23; pt++)   /*envío los datos al display*/
            {
                code_char = 0x20;
                if (x<320 && y<180) ILI9341_Draw_Char(x,y,ColorCaracter,ColorFondo,code_char,4);
                x=x+anch_car;
            }
            break;
   }
   return  fila;
}


/*

char BuscarCodigo(long punt)
{
	char    str[100],ch;
	long	fin=0,i=0;
	char	a,b,c,d,e,enc=0,TipoBusq=0;
	enc=0;

	FondoCartel(46,0x643F);
	TextOut(40,95,"BUSCANDO");

    HAL_Delay(1000);

 	e=LeerSDAbs(punt);
	do
	{
		a=b;
		b=c;
		c=d;
		d=e;
		e=LeerSDRel();

		if( b=='C' && c=='O' && d=='D' && e=='(')
		{
			ReconocerString(str,',');

			for(i=0;i<15;i++)
			{
				if(BufferBus[i]==0x20) BufferBus[i]=0;
			}
			if(BusquedaStr(str,m_TecladoStr) ) enc=1;

			if(enc==1)
			{
				sprintf(m_CodSel,"%s",str);
				ReconocerString(str,',');
				m_IDPrg=ReconocerInt(&ch);
				m_Bmp=ReconocerInt(&ch);
                m_BmpB=ReconocerInt(&ch);
    			m_BmpC=ReconocerInt(&ch);
				m_BmpD=ReconocerInt(&ch);
				m_Var0=ReconocerInt(&ch);
				m_Var1=ReconocerInt(&ch);
                m_Var2=ReconocerInt(&ch);
                m_Var3=ReconocerInt(&ch);
				m_punteroBus=m_PosFlashSD;
			}
			else
			{
				m_PosFlashSD=m_PosFlashSD+100;
			}
		}
		if( b=='F' && c=='I' && d=='G' && e=='(')
		{
			TipoBusq=1;
		}
		if( b=='M' && c=='A' && d=='R' && e=='(' && TipoBusq==1)
		{
			enc=2;
		}
		if( b=='C' && c=='I' && d=='L')
		{
			enc=2;
		}
		if( b=='B' && c=='M' && d=='P')
		{
			enc=2;
		}


	}while(	enc==0 );

	if(enc==1)	return 1;
	else		return 0;
}
*/
char BusquedaStr(char *a, char *b)
{
	int ia,ib,c=0,lb;

	lb=strlen(b);

	for(ia=0;ia+lb<21 && c==0;ia++)
	{
		 c=1;
		 for(ib=0;ib<lb && c==1;ib++)
		 {
			if(a[ia+ib]!=b[ib]) c=0;
		 }
	}
	return c;
}

/////////////////////
// MEMORIA FLASH
/////////////////////

unsigned char LeerFlashAbs(unsigned long Pos);
unsigned char LeerFlashRel();

unsigned char LeerFlashAbs(unsigned long Pos)
{
	m_PosFlashST=Pos;
	m_PosFlashST++;
	return m_Memoria[Pos];
}

unsigned char LeerFlashRel()
{
	unsigned char a=m_Memoria[m_PosFlashST];
	m_PosFlashST++;
	return a;
}
unsigned long Vin2Res(unsigned long in,unsigned long R)
{
	unsigned long Num=R*in;
	unsigned long Den=4070-in;
	return Num/Den;
}

unsigned long Ajustar(unsigned long Valor,unsigned long Numerador,unsigned long Denominador)
{
	return Valor*Numerador/Denominador;
}

void Presentacion(char* Marca,char* Modelo)
{

}

void MenuSet(unsigned char MenuNro,char* Buffer,unsigned int PantallaProx)
{
	int i;

	if(MenuNro==0) m_MenuMax=0,m_PantallaExt=0;
	for(i=0;Buffer[i]!=0 && i<20;i++) m_MenuStr[MenuNro][i]=Buffer[i];
	for(;i<20;i++) m_MenuStr[MenuNro][i]=' ';
	if(MenuNro>m_MenuMax) m_MenuMax=MenuNro;
	m_PantallaProx[MenuNro]=PantallaProx;
}

void MenuPrint()
{

	int i;

	for(i=0;(i+m_PantallaExt*6)<=m_MenuMax && i<6;i++)
		BOW(5,35+33*i,0,22,m_MenuStr[i+m_PantallaExt*6]);

	//BOW(5,202,0,7,"SUBIR");
   	BOW(5,202,0,22,"VOLVER");
   	//BOW(215,202,0,7,"BAJAR");
}

void MenuAtencion(void)
{
	for(int i=0;i<6 && (i+m_PantallaExt*6)<=m_MenuMax;i++)
	{
		if(BOW_Activo(6,35+33*i,22) )
		{
			BOW(5,35+33*i,2,22,m_MenuStr[6*m_PantallaExt+i]);
			m_Pantalla=m_PantallaProx[6*m_PantallaExt+i];
		}
	}
	/*
	if(BOW_Activo(5,202,7) )
	{
		if(m_PantallaExt>0) m_PantallaExt--;
		MenuPrint();
		BOW(5,202,2,7,"SUBIR");
	}*/
	if(BOW_Activo(5,202,22) )
	{
		BOW(5,202,2,22,"VOLVER");
		m_Pantalla=MENU_PRINCIPAL;
	}
	/*
	if(BOW_Activo(215,202,7) )
	{
		if(m_PantallaExt < m_MenuMax/6) m_PantallaExt++;
		MenuPrint();
		BOW(215,202,2,7,"BAJAR");
	}
	*/
}
void ChicharraError(void)
{

}
unsigned int MedirVerde(void)
{
	return 0;
}
unsigned int MedirBlanco(void)
{
	return 0;
}
unsigned int MedirCorriente(void)
{
	return 0;
}

